'''Дана строка, состоящая из слов, разделенных пробелами. 
Определите, сколько в ней слов.'''

print(len(input().split()))
