'''
Формат ввода
Вводится целое неотрицательное число N (N≤100).

Формат вывода
Выведите 2ᴺ.
'''
print(2 ** int(input()))
