'''
Формат ввода
Вводится единственное целое положительное число (гарантируется, что оно не превышает 10000).

Формат вывода
Выведите ответ на задачу.
'''
print(int(input()) % 10)
