'''Дано положительное действительное число X. Выведите его дробную часть.'''
n = float(input())
print(n % 1)
