'''Дана строка. Получите новую строку, вставив между каждыми двумя символами
исходной строки символ *. Выведите полученную строку.'''

print(''.join(list('*'.join(input()))))
